
namespace Kakegurui.Web.Codes.Flow
{
    /// <summary>
    /// 车牌类型
    /// </summary>
    public enum PlateType
    {
        黄牌_大型汽车 = 1,
        蓝牌_小型汽车 = 2,
        使馆 = 3,
        领馆 = 4,
        外籍 = 6,
        两_三轮摩托车 = 7,
        轻便摩托车 = 8,
        使馆摩托车 = 9,
        领馆摩托车 = 10,
        境外摩托车 = 11,
        外籍摩托车 = 12,
        农用摩托车 = 13,
        拖拉机号牌 = 14,
        挂车 = 15,
        教练汽车 = 16,
        教练摩托车 = 17,
        实验汽车 = 18,
        实验摩托车 = 19,
        临时入境汽车 = 20,
        临时入境摩托车 = 21,
        临时行驶车 = 22,
        警车 = 23,
        警用摩托车 = 24,
        港籍 = 26,
        澳籍 = 27,
        武警 = 31,
        军车 = 32,
        小型新能源车牌 = 34,
        大型新能源车牌 = 35,
        未识别 = 99
    }
}
